//? Запросите у пользователя его имя и выведите в ответ: «Привет, его имя!».
function task_1() {
  let firstName = prompt("Введіть ваше імя", "Любомир");
  alert("Привіт, " + firstName + "!");
}
//? Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат.
function task_2() {
  let date_of_birth = prompt("Введдіть рік нродження", "1990");
  let current_year = new Date().getFullYear();
  alert("Вам " + (current_year - date_of_birth) + " років.");
}
//? Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.
function task_3() {
  let legth_square = prompt(
    "Введіть довжину однієї із сторін квадрату в см.",
    "12"
  );
  alert("Периметр квардрату становить " + legth_square * 4 + " см.");
}
//? Запросите у пользователя радиус окружности и выведите площадь такой окружности.
function task_4() {
  let radius_circle = prompt("Введіть радіус кола в см.", "8");
  alert("Площа кола становить " + 3.14 * radius_circle ** 2 + " см²");
}
//? Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться. Посчитайте скорость, с которой необходимо двигаться, чтобы успеть вовремя.
function task_5() {
  let dist_between_cites = prompt("Введіть відстань між містами в км.", "140");
  let time_cites = prompt(
    "Введіть час за який бажаєте подолати дистанцію у хв.",
    "60"
  );
  alert(
    "Вам необхідно рухатись зі швиджкістю " +
      (dist_between_cites / time_cites) * 60 +
      " км/год."
  );
}
//? Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валюты храните в константе.
function task_6() {
  let dolar = prompt("Введіть суму в доларах");
  const dolar_euro = 0.88;
  alert(dolar + " даларів становить " + dolar * dolar_euro + " євро");
}
//? Пользователь указывает объем флешки в Гб. Программа должна посчитать, сколько файлов размером в 820 Мб помещается на флешку.
function task_7() {
  let memory_flesh_size = prompt("Вкажіть об'єм пам'яті накопичувача в Гб.");
  alert(
    "Вибраний Вами об'єм пам'яті дозволяє розмістити " +
      (memory_flesh_size * 1024 - ((memory_flesh_size * 1024) % 820)) / 820 +
      " файлів"
  );
  4;
}
//? Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа выводит, сколько шоколадок может купить пользователь, и сколько сдачи у него останется.
function task_8() {
  let money = prompt("Введіть сумму коштів вашого гаманця у грн.", "100");
  let chokolate_price = prompt("Вкажіть вартість однієї шоколадки у грн.");
  alert(
    "На сумму " +
      money +
      " грн. ви зможите придбати " +
      (money - (money % chokolate_price)) / chokolate_price +
      " шоколадки, а також у Вас залишиться " +
      (money % chokolate_price) +
      " грн. решти."
  );
}
//? Запросите у пользователя трехзначное число и выведите его задом наперед. Для решения задачи вам понадобится оператор % (остаток от деления).
function task_9() {
  let number = prompt("Введіть трьохзначне число", "587");
  alert(
    "" +
      (number % 10) +
      "" +
      ((number % 100) - (number % 10)) / 10 +
      "" +
      (number - (number % 100)) / 100 +
      ""
  );
}
//? Пользователь вводит сумму вклада в банк на 2 месяца, с процентной ставкой депозита 5% годовых. Вывести сумму начисленных процентов.
function task_10() {
  let debit = prompt("Введіть суму вкладу в грн.");
  alert("Сумма нарахованих відсотків " + ((debit / 100) * 5) / 6 + " грн.");
}
